stevenj/avr-libc3/include/avr/io/atmega16hva.h
/* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. */
typedef enum CPU_PA1DID_enum
{
    CPU_PA1DID_CLEAR_gc = (0x00), /* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. - CLEAR */
    CPU_PA1DID_SET_gc   = (0x02), /* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. - SET */
} CPU_PA1DID_t;

/* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. */
typedef enum CPU_PA0DID_enum
{
    CPU_PA0DID_CLEAR_gc = (0x00), /* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. - CLEAR */
    CPU_PA0DID_SET_gc   = (0x01), /* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. - SET */
} CPU_PA0DID_t;

/* Power Reduction Voltage Regulator Monitor */
typedef enum CPU_PRVRM_enum
{
    CPU_PRVRM_CLEAR_gc = (0x00), /* Power Reduction Voltage Regulator Monitor - CLEAR */
    CPU_PRVRM_SET_gc   = (0x20), /* Power Reduction Voltage Regulator Monitor - SET */
} CPU_PRVRM_t;

/* Power reduction SPI */
typedef enum CPU_PRSPI_enum
{
    CPU_PRSPI_CLEAR_gc = (0x00), /* Power reduction SPI - CLEAR */
    CPU_PRSPI_SET_gc   = (0x08), /* Power reduction SPI - SET */
} CPU_PRSPI_t;

/* Power Reduction Timer/Counter1 */
typedef enum CPU_PRTIM1_enum
{
    CPU_PRTIM1_CLEAR_gc = (0x00), /* Power Reduction Timer/Counter1 - CLEAR */
    CPU_PRTIM1_SET_gc   = (0x04), /* Power Reduction Timer/Counter1 - SET */
} CPU_PRTIM1_t;

/* Power Reduction Timer/Counter0 */
typedef enum CPU_PRTIM0_enum
{
    CPU_PRTIM0_CLEAR_gc = (0x00), /* Power Reduction Timer/Counter0 - CLEAR */
    CPU_PRTIM0_SET_gc   = (0x02), /* Power Reduction Timer/Counter0 - SET */
} CPU_PRTIM0_t;

/* Power Reduction V-ADC */
typedef enum CPU_PRVADC_enum
{
    CPU_PRVADC_CLEAR_gc = (0x00), /* Power Reduction V-ADC - CLEAR */
    CPU_PRVADC_SET_gc   = (0x01), /* Power Reduction V-ADC - SET */
} CPU_PRVADC_t;

/* Clock Prescaler Change Enable */
typedef enum CPU_CLKPCE_enum
{
    CPU_CLKPCE_CLEAR_gc = (0x00), /* Clock Prescaler Change Enable - CLEAR */
    CPU_CLKPCE_SET_gc   = (0x80), /* Clock Prescaler Change Enable - SET */
} CPU_CLKPCE_t;

/* Clock Prescaler Select Bits */
#define CPU_CLKPR_CLKPS_gc(x) (x & 0x03)

/*
--------------------------------------------------------------------------------
BATTERY_PROTECTION - Battery Protection
--------------------------------------------------------------------------------
*/

typedef struct BATTERY_PROTECTION_struct
{
    register8_t rsv_0x00[242]; /* RESERVED REGISTER BLOCK */
    register8_t BPIMSK;        /* Battery Protection Interrupt Mask Register */
    register8_t BPIFR;         /* Battery Protection Interrupt Flag Register */
    register8_t rsv_0xF4;      /* RESERVED REGISTER */
    register8_t BPSCD;         /* Battery Protection Short-Circuit Detection Level Register */
    register8_t BPDOCD;        /* Battery Protection Discharge-Over-current Detection Level Register */
    register8_t BPCOCD;        /* Battery Protection Charge-Over-current Detection Level Register */
    register8_t BPDHCD;        /* Battery Protection Discharge-High-current Detection Level Register */
    register8_t BPCHCD;        /* Battery Protection Charge-High-current Detection Level Register */
    register8_t BPSCTR;        /* Battery Protection Short-current Timing Register */
    register8_t BPOCTR;        /* Battery Protection Over-current Timing Register */
    register8_t BPHCTR;        /* Battery Protection Short-current Timing Register */
    register8_t BPCR;          /* Battery Protection Control Register */
    register8_t BPPLR;         /* Battery Protection Parameter Lock Register */
} BATTERY_PROTECTION_t;


/* Battery Protection Parameter Lock Enable */
typedef enum BATTERY_PROTECTION_BPPLE_enum
{
    BATTERY_PROTECTION_BPPLE_CLEAR_gc = (0x00), /* Battery Protection Parameter Lock Enable - CLEAR */
    BATTERY_PROTECTION_BPPLE_SET_gc   = (0x02), /* Battery Protection Parameter Lock Enable - SET */
} BATTERY_PROTECTION_BPPLE_t;

/* Battery Protection Parameter Lock */
typedef enum BATTERY_PROTECTION_BPPL_enum
{
    BATTERY_PROTECTION_BPPL_CLEAR_gc = (0x00), /* Battery Protection Parameter Lock - CLEAR */
    BATTERY_PROTECTION_BPPL_SET_gc   = (0x01), /* Battery Protection Parameter Lock - SET */
} BATTERY_PROTECTION_BPPL_t;

/* Short Circuit Protection Disabled */
typedef enum BATTERY_PROTECTION_SCD_enum
{
    BATTERY_PROTECTION_SCD_CLEAR_gc = (0x00), /* Short Circuit Protection Disabled - CLEAR */
    BATTERY_PROTECTION_SCD_SET_gc   = (0x10), /* Short Circuit Protection Disabled - SET */
} BATTERY_PROTECTION_SCD_t;

/* Discharge Over-current Protection Disabled */
typedef enum BATTERY_PROTECTION_DOCD_enum
{
    BATTERY_PROTECTION_DOCD_CLEAR_gc = (0x00), /* Discharge Over-current Protection Disabled - CLEAR */
    BATTERY_PROTECTION_DOCD_SET_gc   = (0x08), /* Discharge Over-current Protection Disabled - SET */
} BATTERY_PROTECTION_DOCD_t;

/* Charge Over-current Protection Disabled */
typedef enum BATTERY_PROTECTION_COCD_enum
{
    BATTERY_PROTECTION_COCD_CLEAR_gc = (0x00), /* Charge Over-current Protection Disabled - CLEAR */
    BATTERY_PROTECTION_COCD_SET_gc   = (0x04), /* Charge Over-current Protection Disabled - SET */
} BATTERY_PROTECTION_COCD_t;

/* Discharge High-current Protection Disable */
typedef enum BATTERY_PROTECTION_DHCD_enum
{
    BATTERY_PROTECTION_DHCD_CLEAR_gc = (0x00), /* Discharge High-current Protection Disable - CLEAR */
    BATTERY_PROTECTION_DHCD_SET_gc   = (0x02), /* Discharge High-current Protection Disable - SET */
} BATTERY_PROTECTION_DHCD_t;

/* Charge High-current Protection Disable */
typedef enum BATTERY_PROTECTION_CHCD_enum
{
    BATTERY_PROTECTION_CHCD_CLEAR_gc = (0x00), /* Charge High-current Protection Disable - CLEAR */
    BATTERY_PROTECTION_CHCD_SET_gc   = (0x01), /* Charge High-current Protection Disable - SET */
} BATTERY_PROTECTION_CHCD_t;

/* Short-circuit Protection Activated Interrupt Flag */
typedef enum BATTERY_PROTECTION_SCIF_enum
{
    BATTERY_PROTECTION_SCIF_CLEAR_gc = (0x00), /* Short-circuit Protection Activated Interrupt Flag - CLEAR */
    BATTERY_PROTECTION_SCIF_SET_gc   = (0x10), /* Short-circuit Protection Activated Interrupt Flag - SET */
} BATTERY_PROTECTION_SCIF_t;

/* Discharge Over-current Protection Activated Interrupt Flag */
typedef enum BATTERY_PROTECTION_DOCIF_enum
{
    BATTERY_PROTECTION_DOCIF_CLEAR_gc = (0x00), /* Discharge Over-current Protection Activated Interrupt Flag - CLEAR */
    BATTERY_PROTECTION_DOCIF_SET_gc   = (0x08), /* Discharge Over-current Protection Activated Interrupt Flag - SET */
} BATTERY_PROTECTION_DOCIF_t;

/* Charge Over-current Protection Activated Interrupt Flag */
typedef enum BATTERY_PROTECTION_COCIF_enum
{
    BATTERY_PROTECTION_COCIF_CLEAR_gc = (0x00), /* Charge Over-current Protection Activated Interrupt Flag - CLEAR */
    BATTERY_PROTECTION_COCIF_SET_gc   = (0x04), /* Charge Over-current Protection Activated Interrupt Flag - SET */
} BATTERY_PROTECTION_COCIF_t;

/* Disharge High-current Protection Activated Interrupt */
typedef enum BATTERY_PROTECTION_DHCIF_enum
{
    BATTERY_PROTECTION_DHCIF_CLEAR_gc = (0x00), /* Disharge High-current Protection Activated Interrupt - CLEAR */
    BATTERY_PROTECTION_DHCIF_SET_gc   = (0x02), /* Disharge High-current Protection Activated Interrupt - SET */
} BATTERY_PROTECTION_DHCIF_t;

/* Charge High-current Protection Activated Interrupt */
typedef enum BATTERY_PROTECTION_CHCIF_enum
{
    BATTERY_PROTECTION_CHCIF_CLEAR_gc = (0x00), /* Charge High-current Protection Activated Interrupt - CLEAR */
    BATTERY_PROTECTION_CHCIF_SET_gc   = (0x01), /* Charge High-current Protection Activated Interrupt - SET */
} BATTERY_PROTECTION_CHCIF_t;

/* Short-circuit Protection Activated Interrupt Enable */
typedef enum BATTERY_PROTECTION_SCIE_enum
{
    BATTERY_PROTECTION_SCIE_CLEAR_gc = (0x00), /* Short-circuit Protection Activated Interrupt Enable - CLEAR */
    BATTERY_PROTECTION_SCIE_SET_gc   = (0x10), /* Short-circuit Protection Activated Interrupt Enable - SET */
} BATTERY_PROTECTION_SCIE_t;

/* Discharge Over-current Protection Activated Interrupt Enable */
typedef enum BATTERY_PROTECTION_DOCIE_enum
{
    BATTERY_PROTECTION_DOCIE_CLEAR_gc = (0x00), /* Discharge Over-current Protection Activated Interrupt Enable - CLEAR */
    BATTERY_PROTECTION_DOCIE_SET_gc   = (0x08), /* Discharge Over-current Protection Activated Interrupt Enable - SET */
} BATTERY_PROTECTION_DOCIE_t;

