stevenj/avr-libc3/include/avr/io/atmega16hva.h
/* CC-ADC Control and Status Register A-CADPOL */
typedef enum COULOMB_COUNTER_CADPOL_enum
{
    COULOMB_COUNTER_CADPOL_CLEAR_gc = (0x00), /* CC-ADC Control and Status Register A-CADPOL - CLEAR */
    COULOMB_COUNTER_CADPOL_SET_gc   = (0x40), /* CC-ADC Control and Status Register A-CADPOL - SET */
} COULOMB_COUNTER_CADPOL_t;

/* CC_ADC Update Busy */
typedef enum COULOMB_COUNTER_CADUB_enum
{
    COULOMB_COUNTER_CADUB_CLEAR_gc = (0x00), /* CC_ADC Update Busy - CLEAR */
    COULOMB_COUNTER_CADUB_SET_gc   = (0x20), /* CC_ADC Update Busy - SET */
} COULOMB_COUNTER_CADUB_t;

/* CC_ADC Accumulate Current Select Bits */
#define COULOMB_COUNTER_CADCSRA_CADAS_gc(x) ((x<<3) & 0x18)

/* The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined. */
#define COULOMB_COUNTER_CADCSRA_CADSI_gc(x) ((x<<1) & 0x06)

/* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. */
typedef enum COULOMB_COUNTER_CADSE_enum
{
    COULOMB_COUNTER_CADSE_CLEAR_gc = (0x00), /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - CLEAR */
    COULOMB_COUNTER_CADSE_SET_gc   = (0x01), /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - SET */
} COULOMB_COUNTER_CADSE_t;

/* CC-ADC Control and Status Register B-CADACIE */
typedef enum COULOMB_COUNTER_CADACIE_enum
{
    COULOMB_COUNTER_CADACIE_CLEAR_gc = (0x00), /* CC-ADC Control and Status Register B-CADACIE - CLEAR */
    COULOMB_COUNTER_CADACIE_SET_gc   = (0x40), /* CC-ADC Control and Status Register B-CADACIE - SET */
} COULOMB_COUNTER_CADACIE_t;

/* Regular Current Interrupt Enable */
typedef enum COULOMB_COUNTER_CADRCIE_enum
{
    COULOMB_COUNTER_CADRCIE_CLEAR_gc = (0x00), /* Regular Current Interrupt Enable - CLEAR */
    COULOMB_COUNTER_CADRCIE_SET_gc   = (0x20), /* Regular Current Interrupt Enable - SET */
} COULOMB_COUNTER_CADRCIE_t;

/* CAD Instantenous Current Interrupt Enable */
typedef enum COULOMB_COUNTER_CADICIE_enum
{
    COULOMB_COUNTER_CADICIE_CLEAR_gc = (0x00), /* CAD Instantenous Current Interrupt Enable - CLEAR */
    COULOMB_COUNTER_CADICIE_SET_gc   = (0x10), /* CAD Instantenous Current Interrupt Enable - SET */
} COULOMB_COUNTER_CADICIE_t;

/* CC-ADC Accumulate Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADACIF_enum
{
    COULOMB_COUNTER_CADACIF_CLEAR_gc = (0x00), /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADACIF_SET_gc   = (0x04), /* CC-ADC Accumulate Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADACIF_t;

/* CC-ADC Accumulate Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADRCIF_enum
{
    COULOMB_COUNTER_CADRCIF_CLEAR_gc = (0x00), /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADRCIF_SET_gc   = (0x02), /* CC-ADC Accumulate Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADRCIF_t;

/* CC-ADC Instantaneous Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADICIF_enum
{
    COULOMB_COUNTER_CADICIF_CLEAR_gc = (0x00), /* CC-ADC Instantaneous Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADICIF_SET_gc   = (0x01), /* CC-ADC Instantaneous Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADICIF_t;

/*
--------------------------------------------------------------------------------
VOLTAGE_REGULATOR - Voltage Regulator
--------------------------------------------------------------------------------
*/

typedef struct VOLTAGE_REGULATOR_struct
{
    register8_t rsv_0x00[200]; /* RESERVED REGISTER BLOCK */
    register8_t ROCR;          /* Regulator Operating Condition Register */
} VOLTAGE_REGULATOR_t;


/* ROC Status */
typedef enum VOLTAGE_REGULATOR_ROCS_enum
{
    VOLTAGE_REGULATOR_ROCS_CLEAR_gc = (0x00), /* ROC Status - CLEAR */
    VOLTAGE_REGULATOR_ROCS_SET_gc   = (0x80), /* ROC Status - SET */
} VOLTAGE_REGULATOR_ROCS_t;

/* ROC Warning Interrupt Flag */
typedef enum VOLTAGE_REGULATOR_ROCWIF_enum
{
    VOLTAGE_REGULATOR_ROCWIF_CLEAR_gc = (0x00), /* ROC Warning Interrupt Flag - CLEAR */
    VOLTAGE_REGULATOR_ROCWIF_SET_gc   = (0x02), /* ROC Warning Interrupt Flag - SET */
} VOLTAGE_REGULATOR_ROCWIF_t;

/* ROC Warning Interrupt Enable */
typedef enum VOLTAGE_REGULATOR_ROCWIE_enum
{
    VOLTAGE_REGULATOR_ROCWIE_CLEAR_gc = (0x00), /* ROC Warning Interrupt Enable - CLEAR */
    VOLTAGE_REGULATOR_ROCWIE_SET_gc   = (0x01), /* ROC Warning Interrupt Enable - SET */
} VOLTAGE_REGULATOR_ROCWIE_t;
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define ADC                (*(ADC_t *) 0x0000)                /* Analog-to-Digital Converter */
#define WDT                (*(WDT_t *) 0x0000)                /* Watchdog Timer */
#define BANDGAP            (*(BANDGAP_t *) 0x0000)            /* Bandgap */
#define EXINT              (*(EXINT_t *) 0x0000)              /* External Interrupts */
#define PORTC              (*(PORTC_t *) 0x0000)              /* I/O Port */
#define PORTA              (*(PORTA_t *) 0x0000)              /* I/O Port */
#define PORTB              (*(PORTB_t *) 0x0000)              /* I/O Port */
#define FET                (*(FET_t *) 0x0000)                /* FET Control */
#define SPI                (*(SPI_t *) 0x0000)                /* Serial Peripheral Interface */
#define BOOT_LOAD          (*(BOOT_LOAD_t *) 0x0000)          /* Bootloader */
#define CPU                (*(CPU_t *) 0x0000)                /* CPU Registers */
#define BATTERY_PROTECTION (*(BATTERY_PROTECTION_t *) 0x0000) /* Battery Protection */
#define EEPROM             (*(EEPROM_t *) 0x0000)             /* EEPROM */
#define TC1                (*(TC1_t *) 0x0000)                /* Timer/Counter, 16-bit */
#define TC0                (*(TC0_t *) 0x0000)                /* Timer/Counter, 16-bit */
#define COULOMB_COUNTER    (*(COULOMB_COUNTER_t *) 0x0000)    /* Coulomb Counter */
#define VOLTAGE_REGULATOR  (*(VOLTAGE_REGULATOR_t *) 0x0000)  /* Voltage Regulator */
#define FUSE               (*(FUSE_t *) 0x0000)               /* Fuses */
#define LOCKBIT            (*(LOCKBIT_t *) 0x0000)            /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


