stevenj/avr-libc3/include/avr/io/atmega16hva.h
/* Charge Over-current Protection Activated Interrupt Enable */
#define BATTERY_PROTECTION_COCIE_CLEAR_gc (0x00) /* Charge Over-current Protection Activated Interrupt Enable - CLEAR */
#define BATTERY_PROTECTION_COCIE_SET_gc   (0x04) /* Charge Over-current Protection Activated Interrupt Enable - SET */


/* Discharger High-current Protection Activated Interrupt */
#define BATTERY_PROTECTION_DHCIE_CLEAR_gc (0x00) /* Discharger High-current Protection Activated Interrupt - CLEAR */
#define BATTERY_PROTECTION_DHCIE_SET_gc   (0x02) /* Discharger High-current Protection Activated Interrupt - SET */


/* Charger High-current Protection Activated Interrupt */
#define BATTERY_PROTECTION_CHCIE_CLEAR_gc (0x00) /* Charger High-current Protection Activated Interrupt - CLEAR */
#define BATTERY_PROTECTION_CHCIE_SET_gc   (0x01) /* Charger High-current Protection Activated Interrupt - SET */


/*
--------------------------------------------------------------------------------
EEPROM - EEPROM
--------------------------------------------------------------------------------
*/


/* EEPROM Control Register-EEPM */
#define EEPROM_EEPM_VAL_0x00_gc (0x00<<4) /* Erase and Write in one operation */
#define EEPROM_EEPM_VAL_0x01_gc (0x01<<4) /* Erase Only */
#define EEPROM_EEPM_VAL_0x02_gc (0x02<<4) /* Write Only */


/* EEProm Ready Interrupt Enable */
#define EEPROM_EERIE_CLEAR_gc (0x00) /* EEProm Ready Interrupt Enable - CLEAR */
#define EEPROM_EERIE_SET_gc   (0x08) /* EEProm Ready Interrupt Enable - SET */


/* EEPROM Master Write Enable */
#define EEPROM_EEMPE_CLEAR_gc (0x00) /* EEPROM Master Write Enable - CLEAR */
#define EEPROM_EEMPE_SET_gc   (0x04) /* EEPROM Master Write Enable - SET */


/* EEPROM Write Enable */
#define EEPROM_EEPE_CLEAR_gc (0x00) /* EEPROM Write Enable - CLEAR */
#define EEPROM_EEPE_SET_gc   (0x02) /* EEPROM Write Enable - SET */


/* EEPROM Read Enable */
#define EEPROM_EERE_CLEAR_gc (0x00) /* EEPROM Read Enable - CLEAR */
#define EEPROM_EERE_SET_gc   (0x01) /* EEPROM Read Enable - SET */


/*
--------------------------------------------------------------------------------
TC16 - Timer/Counter, 16-bit
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
TC16 - Timer/Counter, 16-bit
--------------------------------------------------------------------------------
*/


/* Timer/Counter Width */
#define TC1_TCW1_CLEAR_gc (0x00) /* Timer/Counter Width - CLEAR */
#define TC1_TCW1_SET_gc   (0x80) /* Timer/Counter Width - SET */


/* Input Capture Mode Enable */
#define TC1_ICEN1_CLEAR_gc (0x00) /* Input Capture Mode Enable - CLEAR */
#define TC1_ICEN1_SET_gc   (0x40) /* Input Capture Mode Enable - SET */


/* Input Capture Noise Canceler */
#define TC1_ICNC1_CLEAR_gc (0x00) /* Input Capture Noise Canceler - CLEAR */
#define TC1_ICNC1_SET_gc   (0x20) /* Input Capture Noise Canceler - SET */


/* Input Capture Edge Select */
#define TC1_ICES1_CLEAR_gc (0x00) /* Input Capture Edge Select - CLEAR */
#define TC1_ICES1_SET_gc   (0x10) /* Input Capture Edge Select - SET */


/* Input Capture Select */
#define TC1_ICS1_CLEAR_gc (0x00) /* Input Capture Select - CLEAR */
#define TC1_ICS1_SET_gc   (0x08) /* Input Capture Select - SET */


/* Waveform Generation Mode */
#define TC1_WGM10_CLEAR_gc (0x00) /* Waveform Generation Mode - CLEAR */
#define TC1_WGM10_SET_gc   (0x01) /* Waveform Generation Mode - SET */


/* Timer/Counter n Input Capture Interrupt Enable */
#define TC1_ICIE1_CLEAR_gc (0x00) /* Timer/Counter n Input Capture Interrupt Enable - CLEAR */
#define TC1_ICIE1_SET_gc   (0x08) /* Timer/Counter n Input Capture Interrupt Enable - SET */


/* Timer/Counter1 Output Compare B Interrupt Enable */
#define TC1_OCIE1B_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare B Interrupt Enable - CLEAR */
#define TC1_OCIE1B_SET_gc   (0x04) /* Timer/Counter1 Output Compare B Interrupt Enable - SET */


/* Timer/Counter1 Output Compare A Interrupt Enable */
#define TC1_OCIE1A_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare A Interrupt Enable - CLEAR */
#define TC1_OCIE1A_SET_gc   (0x02) /* Timer/Counter1 Output Compare A Interrupt Enable - SET */


/* Timer/Counter1 Overflow Interrupt Enable */
#define TC1_TOIE1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
#define TC1_TOIE1_SET_gc   (0x01) /* Timer/Counter1 Overflow Interrupt Enable - SET */


/* Timer/Counter 1 Input Capture Flag */
#define TC1_ICF1_CLEAR_gc (0x00) /* Timer/Counter 1 Input Capture Flag - CLEAR */
#define TC1_ICF1_SET_gc   (0x08) /* Timer/Counter 1 Input Capture Flag - SET */


/* Timer/Counter1 Output Compare Flag B */
#define TC1_OCF1B_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag B - CLEAR */
#define TC1_OCF1B_SET_gc   (0x04) /* Timer/Counter1 Output Compare Flag B - SET */


/* Timer/Counter1 Output Compare Flag A */
#define TC1_OCF1A_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag A - CLEAR */
#define TC1_OCF1A_SET_gc   (0x02) /* Timer/Counter1 Output Compare Flag A - SET */


/* Timer/Counter1 Overflow Flag */
#define TC1_TOV1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Flag - CLEAR */
#define TC1_TOV1_SET_gc   (0x01) /* Timer/Counter1 Overflow Flag - SET */


/* Timer/Counter Synchronization Mode */
#define TC1_TSM_CLEAR_gc (0x00) /* Timer/Counter Synchronization Mode - CLEAR */
#define TC1_TSM_SET_gc   (0x80) /* Timer/Counter Synchronization Mode - SET */


/* Prescaler Reset */
#define TC1_PSRSYNC_CLEAR_gc (0x00) /* Prescaler Reset - CLEAR */
#define TC1_PSRSYNC_SET_gc   (0x01) /* Prescaler Reset - SET */


/* Timer/Counter Width */
#define TC0_TCW0_CLEAR_gc (0x00) /* Timer/Counter Width - CLEAR */
#define TC0_TCW0_SET_gc   (0x80) /* Timer/Counter Width - SET */


/* Input Capture Mode Enable */
#define TC0_ICEN0_CLEAR_gc (0x00) /* Input Capture Mode Enable - CLEAR */
#define TC0_ICEN0_SET_gc   (0x40) /* Input Capture Mode Enable - SET */


/* Input Capture Noise Canceler */
#define TC0_ICNC0_CLEAR_gc (0x00) /* Input Capture Noise Canceler - CLEAR */
#define TC0_ICNC0_SET_gc   (0x20) /* Input Capture Noise Canceler - SET */


