stevenj/avr-libc3/include/avr/io/atmega16hva.h
/* Input Capture Edge Select */
#define TC0_ICES0_CLEAR_gc (0x00) /* Input Capture Edge Select - CLEAR */
#define TC0_ICES0_SET_gc   (0x10) /* Input Capture Edge Select - SET */


/* Input Capture Select */
#define TC0_ICS0_CLEAR_gc (0x00) /* Input Capture Select - CLEAR */
#define TC0_ICS0_SET_gc   (0x08) /* Input Capture Select - SET */


/* Clock Select0 bit 0 */
#define TC0_WGM00_CLEAR_gc (0x00) /* Clock Select0 bit 0 - CLEAR */
#define TC0_WGM00_SET_gc   (0x01) /* Clock Select0 bit 0 - SET */


/* Clock Select0 bit 2 */
#define TC0_CS02_CLEAR_gc (0x00) /* Clock Select0 bit 2 - CLEAR */
#define TC0_CS02_SET_gc   (0x04) /* Clock Select0 bit 2 - SET */


/* Clock Select0 bit 1 */
#define TC0_CS01_CLEAR_gc (0x00) /* Clock Select0 bit 1 - CLEAR */
#define TC0_CS01_SET_gc   (0x02) /* Clock Select0 bit 1 - SET */


/* Clock Select0 bit 0 */
#define TC0_CS00_CLEAR_gc (0x00) /* Clock Select0 bit 0 - CLEAR */
#define TC0_CS00_SET_gc   (0x01) /* Clock Select0 bit 0 - SET */


/* Timer/Counter n Input Capture Interrupt Enable */
#define TC0_ICIE0_CLEAR_gc (0x00) /* Timer/Counter n Input Capture Interrupt Enable - CLEAR */
#define TC0_ICIE0_SET_gc   (0x08) /* Timer/Counter n Input Capture Interrupt Enable - SET */


/* Output Compare Interrupt Enable */
#define TC0_OCIE0B_CLEAR_gc (0x00) /* Output Compare Interrupt Enable - CLEAR */
#define TC0_OCIE0B_SET_gc   (0x04) /* Output Compare Interrupt Enable - SET */


/* Output Compare Interrupt Enable */
#define TC0_OCIE0A_CLEAR_gc (0x00) /* Output Compare Interrupt Enable - CLEAR */
#define TC0_OCIE0A_SET_gc   (0x02) /* Output Compare Interrupt Enable - SET */


/* Overflow Interrupt Enable */
#define TC0_TOIE0_CLEAR_gc (0x00) /* Overflow Interrupt Enable - CLEAR */
#define TC0_TOIE0_SET_gc   (0x01) /* Overflow Interrupt Enable - SET */


/* Timer/Counter Interrupt Flag Register */
#define TC0_ICF0_CLEAR_gc (0x00) /* Timer/Counter Interrupt Flag Register - CLEAR */
#define TC0_ICF0_SET_gc   (0x08) /* Timer/Counter Interrupt Flag Register - SET */


/* Output Compare Flag */
#define TC0_OCF0B_CLEAR_gc (0x00) /* Output Compare Flag - CLEAR */
#define TC0_OCF0B_SET_gc   (0x04) /* Output Compare Flag - SET */


/* Output Compare Flag */
#define TC0_OCF0A_CLEAR_gc (0x00) /* Output Compare Flag - CLEAR */
#define TC0_OCF0A_SET_gc   (0x02) /* Output Compare Flag - SET */


/* Overflow Flag */
#define TC0_TOV0_CLEAR_gc (0x00) /* Overflow Flag - CLEAR */
#define TC0_TOV0_SET_gc   (0x01) /* Overflow Flag - SET */


/*
--------------------------------------------------------------------------------
COULOMB_COUNTER - Coulomb Counter
--------------------------------------------------------------------------------
*/


/* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. */
#define COULOMB_COUNTER_CADEN_CLEAR_gc (0x00) /* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. - CLEAR */
#define COULOMB_COUNTER_CADEN_SET_gc   (0x80) /* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. - SET */


/* CC-ADC Control and Status Register A-CADPOL */
#define COULOMB_COUNTER_CADPOL_CLEAR_gc (0x00) /* CC-ADC Control and Status Register A-CADPOL - CLEAR */
#define COULOMB_COUNTER_CADPOL_SET_gc   (0x40) /* CC-ADC Control and Status Register A-CADPOL - SET */


/* CC_ADC Update Busy */
#define COULOMB_COUNTER_CADUB_CLEAR_gc (0x00) /* CC_ADC Update Busy - CLEAR */
#define COULOMB_COUNTER_CADUB_SET_gc   (0x20) /* CC_ADC Update Busy - SET */


/* CC_ADC Accumulate Current Select Bits */
#define COULOMB_COUNTER_CADCSRA_CADAS_gc(x) ((x<<3) & 0x18)

/* The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined. */
#define COULOMB_COUNTER_CADCSRA_CADSI_gc(x) ((x<<1) & 0x06)

/* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. */
#define COULOMB_COUNTER_CADSE_CLEAR_gc (0x00) /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - CLEAR */
#define COULOMB_COUNTER_CADSE_SET_gc   (0x01) /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - SET */


/* CC-ADC Control and Status Register B-CADACIE */
#define COULOMB_COUNTER_CADACIE_CLEAR_gc (0x00) /* CC-ADC Control and Status Register B-CADACIE - CLEAR */
#define COULOMB_COUNTER_CADACIE_SET_gc   (0x40) /* CC-ADC Control and Status Register B-CADACIE - SET */


/* Regular Current Interrupt Enable */
#define COULOMB_COUNTER_CADRCIE_CLEAR_gc (0x00) /* Regular Current Interrupt Enable - CLEAR */
#define COULOMB_COUNTER_CADRCIE_SET_gc   (0x20) /* Regular Current Interrupt Enable - SET */


/* CAD Instantenous Current Interrupt Enable */
#define COULOMB_COUNTER_CADICIE_CLEAR_gc (0x00) /* CAD Instantenous Current Interrupt Enable - CLEAR */
#define COULOMB_COUNTER_CADICIE_SET_gc   (0x10) /* CAD Instantenous Current Interrupt Enable - SET */


/* CC-ADC Accumulate Current Interrupt Flag */
#define COULOMB_COUNTER_CADACIF_CLEAR_gc (0x00) /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
#define COULOMB_COUNTER_CADACIF_SET_gc   (0x04) /* CC-ADC Accumulate Current Interrupt Flag - SET */


/* CC-ADC Accumulate Current Interrupt Flag */
#define COULOMB_COUNTER_CADRCIF_CLEAR_gc (0x00) /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
#define COULOMB_COUNTER_CADRCIF_SET_gc   (0x02) /* CC-ADC Accumulate Current Interrupt Flag - SET */


/* CC-ADC Instantaneous Current Interrupt Flag */
#define COULOMB_COUNTER_CADICIF_CLEAR_gc (0x00) /* CC-ADC Instantaneous Current Interrupt Flag - CLEAR */
#define COULOMB_COUNTER_CADICIF_SET_gc   (0x01) /* CC-ADC Instantaneous Current Interrupt Flag - SET */


