stevenj/avr-libc3/include/avr/io/atmega16hva.h
#define EEPROMMEM_START         (0x0000)                               
#define EEPROMMEM_SIZE          (0x0100)                               
#define EEPROMMEM_END           (EEPROMMEM_START + EEPROMMEM_SIZE - 1) 

#define EEPROM_START            (0x0000)                               
#define EEPROM_SIZE             (0x0100)                               
#define EEPROM_PAGE_SIZE        (0x0004)                               
#define EEPROM_END              (EEPROM_START + EEPROM_SIZE - 1)       

/* Added MAPPED_EEPROM segment names for avr-libc */
#define MAPPED_EEPROM_START     (EEPROM_START)                         
#define MAPPED_EEPROM_SIZE      (EEPROM_SIZE)                          
#define MAPPED_EEPROM_PAGE_SIZE (EEPROM_PAGE_SIZE)                     
#define MAPPED_EEPROM_END       (EEPROM_END)                           

#define IOMEM_START (0x0000)                       
#define IOMEM_SIZE  (0x0040)                       
#define IOMEM_END   (IOMEM_START + IOMEM_SIZE - 1) 

/* ============ Port Bits ============ */

#define PORTC0 (0) 
#define PORTA0 (0) 
#define PORTA1 (1) 
#define PORTB0 (0) 
#define PORTB1 (1) 
#define PORTB2 (2) 
#define PORTB3 (3) 

/*
================================================================================
Fuses/LockBits/Signatures
================================================================================
*/

/* ============ Fuses ============ */

#define FUSE_MEMORY_SIZE 0 

/* Fuse offset 0x00 */
#define SUT0      (unsigned char)~_BV(0) /* Select start-up time bit 0 */
#define SUT1      (unsigned char)~_BV(1) /* Select start-up time bit 1 */
#define SUT2      (unsigned char)~_BV(2) /* Select start-up time bit 2 */
#define SELFPRGEN (unsigned char)~_BV(3) /* Self Programming enable */
#define DWEN      (unsigned char)~_BV(4) /* Debug Wire enable */
#define SPIEN     (unsigned char)~_BV(5) /* Serial program downloading (SPI) enabled */
#define EESAVE    (unsigned char)~_BV(6) /* Preserve EEPROM through the Chip Erase cycle */
#define WDTON     (unsigned char)~_BV(7) /* Watch-dog Timer always on */


/* ========== Lock Bits ========== */
#define __LOCK_BITS_EXIST  


/* ========== Signature ========== */
#define SIGNATURE_0 (0x1E) 
#define SIGNATURE_1 (0x94) 
#define SIGNATURE_2 (0x0C) 

#endif /* #ifdef _AVR_ATmega16HVA_H_INCLUDED */
